; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	image0 - mode
	thermograph1 - mode
	Star1 - direction
	Star3 - direction
	Star4 - direction
	GroundStation2 - direction
	GroundStation6 - direction
	Star0 - direction
	Star5 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Star16 - direction
	Phenomenon17 - direction
)
(:init
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 GroundStation6)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
	(supports instrument3 image0)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 Star0)
	(calibration_target instrument3 Star5)
	(supports instrument4 thermograph1)
	(supports instrument4 image0)
	(calibration_target instrument4 Star5)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon12)
)
(:goal (and
	(pointing satellite0 GroundStation2)
	(pointing satellite1 Star4)
	(pointing satellite2 Star1)
	(have_image Planet7 image0)
	(have_image Star8 thermograph1)
	(have_image Phenomenon9 thermograph1)
	(have_image Star10 thermograph1)
	(have_image Star11 thermograph1)
	(have_image Phenomenon12 thermograph1)
	(have_image Phenomenon13 image0)
	(have_image Phenomenon14 image0)
	(have_image Phenomenon15 thermograph1)
	(have_image Star16 image0)
	(have_image Phenomenon17 image0)
))

)

; plan
1. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 14
2. (calibrate satellite1 instrument2 groundstation6)
   added: (calibrated instrument2)
   goals met: 0 of 14
3. (turn_to satellite1 phenomenon15 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 phenomenon15)
   goals met: 0 of 14
4. (take_image satellite1 phenomenon15 instrument2 thermograph1)
   added: (have_image phenomenon15 thermograph1)
   goals met: 1 of 14
5. (turn_to satellite1 phenomenon14 phenomenon15)
   deleted: (pointing satellite1 phenomenon15)
   added: (pointing satellite1 phenomenon14)
   goals met: 1 of 14
6. (take_image satellite1 phenomenon14 instrument2 image0)
   added: (have_image phenomenon14 image0)
   goals met: 2 of 14
7. (turn_to satellite1 phenomenon13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon13)
   goals met: 2 of 14
8. (take_image satellite1 phenomenon13 instrument2 image0)
   added: (have_image phenomenon13 image0)
   goals met: 3 of 14
9. (turn_to satellite1 phenomenon12 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon12)
   goals met: 3 of 14
10. (turn_to satellite0 groundstation2 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation2)
   goals met: 4 of 14
11. (take_image satellite1 phenomenon12 instrument2 thermograph1)
   added: (have_image phenomenon12 thermograph1)
   goals met: 5 of 14
12. (turn_to satellite1 phenomenon17 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 phenomenon17)
   goals met: 5 of 14
13. (take_image satellite1 phenomenon17 instrument2 image0)
   added: (have_image phenomenon17 image0)
   goals met: 6 of 14
14. (turn_to satellite1 phenomenon9 phenomenon17)
   deleted: (pointing satellite1 phenomenon17)
   added: (pointing satellite1 phenomenon9)
   goals met: 6 of 14
15. (take_image satellite1 phenomenon9 instrument2 thermograph1)
   added: (have_image phenomenon9 thermograph1)
   goals met: 7 of 14
16. (turn_to satellite1 planet7 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 planet7)
   goals met: 7 of 14
17. (take_image satellite1 planet7 instrument2 image0)
   added: (have_image planet7 image0)
   goals met: 8 of 14
18. (turn_to satellite1 star10 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star10)
   goals met: 8 of 14
19. (take_image satellite1 star10 instrument2 thermograph1)
   added: (have_image star10 thermograph1)
   goals met: 9 of 14
20. (turn_to satellite1 star11 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star11)
   goals met: 9 of 14
21. (take_image satellite1 star11 instrument2 thermograph1)
   added: (have_image star11 thermograph1)
   goals met: 10 of 14
22. (turn_to satellite1 star16 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star16)
   goals met: 10 of 14
23. (take_image satellite1 star16 instrument2 image0)
   added: (have_image star16 image0)
   goals met: 11 of 14
24. (turn_to satellite1 star8 star16)
   deleted: (pointing satellite1 star16)
   added: (pointing satellite1 star8)
   goals met: 11 of 14
25. (take_image satellite1 star8 instrument2 thermograph1)
   added: (have_image star8 thermograph1)
   goals met: 12 of 14
26. (turn_to satellite1 star4 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star4)
   goals met: 13 of 14
27. (turn_to satellite2 star1 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 star1)
   goals met: 14 of 14
